go-app/benchmark/results/gin_sustained_20250911_120331.txt
Running 30s test @ http://localhost:8081/api/alerts
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.09ms   64.19ms 500.93ms   85.37%
    Req/Sec     1.46k   674.31     2.88k    65.42%
  161914 requests in 30.09s, 124.15MB read
Requests/sec:   5381.61
Transfer/sec:      4.13MB